import { TLector } from "./types";
import glebImg from "../assets/lab/gleb.jpg";
import yuliaImg from "../assets/lab/yulia.webp";
import sashaImg from "../assets/lab/sasha.jpg";
import kolyaImg from "../assets/lab/kolya.jpg";
import tanyaImg from "../assets/lab/tanya.jpg";
import irinaImg from "../assets/lab/irina.jpg";
import iliaImg from "../assets/lab/ilya.webp";

export const lectors: TLector[] = [
  {
    id: 1,
    name: "Юлия Мигунова",
    description:
      'Родилась в Нижнем Новгороде, где в 2009 году окончила консерваторию по классу виолончели (преподаватель Вишневский П.Д.). В составе струнного квартета «Cantando» является лауреатом многочисленных международных конкурсов и фестивалей. В 2011 году квартет стал лауреатом I Всероссийского музыкального конкурса в Москве.С 2011 года активно занимается исполнением современной музыки. Активный участник фестивалей современной музыки.Сотрудничает с солистами и композиторами из разных стран, на ее счету множество мировых и российских премьер. С 2016 года участница струнного квартета "Vacuum quartet".С 2022 года работает в Центре электроакустической музыки Московской консерватории, является артисткой CEAM Artists.',
    photo: yuliaImg,
  },
  {
    id: 2,
    name: "Глеб Хохлов",
    description:
      "Родился в Перми. В 2016 г. с отличием окончил ФИСИИ МГК им. П.И.Чайковского (класс профессора Мельникова А.А. — скрипка; класс Катаржновой М.Н. — барочная скрипка).В 2018 г . закончил обучение ассистентуре — стажировке МГК им П.И.Чайковского, на факультете «Оркестр современный музыки» под руководством профе ссора В.Г .Тарнопольского.                                         По его инициативе в 2017 году был создан коллектив «Ancient & Contemporary String Quartet», в который вошли выпускники МГК им. П.И.Чайковского. В 2020-ом году квартет сменил название и существует как Vacuum Quartet. Квартет специализируется на исполнении произведений современных композиторов.                                         Выступал с множеством выдающихся музыкантов, принимал участие в мастер - классах ведущих специалистов в области современного и исторического исполнительского искусства. В настоящее время ведет активную концертную жизнь. Осуществил множество российских и мировых премьер сочинений современных композиторов, постоянный участник фестивалей современной музыки в России и за рубежом.",
    photo: glebImg,
  },
  {
    id: 3,
    name: "Николай Попов",
    description:
      "Композитор, педагог, исследователь, продюсер, член союза композиторов России, член союза Московских композиторов, член творческого союза художников России, директор и художественный руководитель Центра электроакустической музыки московской консерватории (ЦЭАМ/CEAM), преподаватель кафедры современной музыки Московской консерватории. Основатель и художественный руководитель (совместно с Александром Хубеевым) ежегодного мультимедийного фестиваля «Биомеханика».                                       Окончил Московскую государственную консерваторию им. П. И. Чайковского по кл. комп. у В. Г. Агафонникова и И. Л. Кефалиди, а затем аспирантуру моск. конс. под руководством В. В. Задерацкого.                                                             Его сочинения исполняются ведущими коллективами страны в разных городах России и зарубежных странах.",
    photo: kolyaImg,
  },
  {
    id: 4,
    name: "Александр Хубеев",
    description:
      'Родился в Перми. В 2011 году закончил композиторский факультет МГК имени Чайковского, в 2014 году - аспирантуру МГК имени Чайковского (класс композиции Юрия Каспарова, класс электроакустической музыки Игоря Кефалиди). Художественный руководитель Международной Академии Молодых Композиторов в городе Чайковском, сооснователь и куратор Композиторских Курсов reMusik.org в Санкт-Петербурге, сооснователь и соруководитель мультимедийного фестиваля "Биомеханика" Московской Государственной Консерватории имени П. И. Чайковского (совместно с Николаем Поповым). Член Союза композиторов России. Его музыку исполняют ведущие коллективы в более чем в 30 странах Европы, Азии, Северной и Южной Америки.',
    photo: sashaImg,
  },
  {
    id: 5,
    name: "Ирина Севастьянова",
    description:
      "Музыкальный журналист и продюсер. Автор изданий «Афиша. Daily», «Большой город», «Правила жизни», «Большой театр», Stravinsky.online. Один из кураторов фестиваля современной музыки Gnesin Contemporary Music Week; создательница образовательных программ для критиков, исследователей и исполнителей, а также концертов в разных форматах. Выпускница РАМ имени Гнесиных по специальности «Музыкальная журналистика».",
    photo: irinaImg,
  },
  {
    id: 6,
    name: "Татьяна Яковлева",
    description:
      "Музыковед, музыкальный журналист, куратор, лектор.Старший преподаватель кафедры менеджмента музыкального  искусства Российской академии музыки имени Гнесиных.                 Окончила аспирантуру Российской академии музыки имени Гнесиных. Сооснователь проекта Gnesin Contemporary Music Week, сайт о современной музыке Stravinsky.online. Публикуется в различных научных и публицистических журналах. Участник всероссийских и международных научных конференций. Основная область исследования — современная музыка, театрально-музыкальные жанры, творчество Жоржа Апергиса.",
    photo: tanyaImg,
  },
  {
    id: 7,
    name: "Илья Ковальский",
    description:
      "Звукоинженер ЦЭАМ.  Занимается музыкальным программированием, монтажом и звукозаписью. Как звукорежиссер проводит концерты, спектакли и трансляции. Взаимодействует с композиторами и ансамблями при создании электроакустических и мультимедийных произведений. Участвовал во множестве российских и зарубежных фестивалей.",
    photo: iliaImg,
  },
];
